---
kind: other
id: Methods.T:Autodesk.Revit.DB.FilterElementIdRule
source: html/c8afb675-24ca-fec0-4a62-487d6e8bae3f.htm
---
# FilterElementIdRule Methods

Derived classes override this method to implement the test that determines
 whether the given element passes this rule or not.